//============================================================ ИМПОРТ БИБЛИОТЕК ===========================================================\\
// При указании абсолютного пути Webpack понимает, что импортируется не пользовательский модуль, а внешняя библотека:
import collect from "collect.js";

//============================================================= ИМПОРТ МОДУЛЕЙ ============================================================\\
// Для импорта внешних пользовательских модулей необходимо указать относительный путь:
import functionHello from "./modules/some-module";

//============================================================== ИМПОРТ СТИЛЕЙ ============================================================\\
// Импорт стилей производится для указанию webpack, что данные файлы необходимо включить в сборку:
import './styles/style.sass';

//=========================================================== ИМПОРТ ИЗОБРАЖЕНИЙ ==========================================================\\
// При импорте изображений извлекается путь до соответствующего изображения:
import BmwImage from "./assets/images/bmw.jpeg";

//=========================================================== ИМПОРТ JSON-ФАЙЛОВ =========================================================\\
// Webpack по-умолчанию умеет обрабатывать JSON-файлы:
import json from "./assets/json.json";

//============================================================= ИСПОЛЬЗОВАНИЕ ============================================================\\

// Использование внешней библиотеки:
console.log("Получение среднего значения элементов массива с помощью библиотеки 'collect':", collect([1, 3, 3, 7]).avg());

// Использование модулей:
functionHello("Владимир Путин")

// Использование изображений:
const imageBlock = document.createElement("img");                           // Создание тега <img/>
imageBlock.style.cssText = 'width: 500px; display: block; margin: 0 auto;'; // Задание стилей изображению:
imageBlock.src = BmwImage;                                                  // Установка изображения
document.body.appendChild(imageBlock);                                      // Добавление изображения на страницу

// Использование JSON-файлов:
console.log("Использование json-файла:", json);